LEXICON_RU: dict[str, str] = {
    '/start': '👋 Привет! Я ваш виртуальный помощник по продаже техники! 💻📱\nЗдесь вы можете:\n\nНайти технику: Ищите новые или б/у устройства по вашим предпочтениям.\nПолучить советы: Узнайте, какая техника лучше всего подходит для ваших нужд.\nЗадать вопросы: У меня есть ответы на любые вопросы о технике и ее использовании.\nПолучить уведомления: Подпишитесь на обновления и специальные предложения!\n💬 Просто напишите мне /menu, и я с радостью помогу вам сделать лучший выбор!',
    '/help': '🛠️ Помощь и поддержка 🤖\nЯ здесь, чтобы помочь вам с поиском и покупкой техники! Вот список команд, которые вы можете использовать:\n\n/поиск - Найдите технику по вашим критериям. Укажите, что именно вы ищете!\n\n/сравнение - Сравните разные устройства, чтобы выбрать лучшее.\n\n/советы - Получите рекомендации по выбору и использованию техники.\n/акции - Узнайте о текущих скидках и специальных предложениях.\n/контакты - Свяжитесь с нашей командой поддержки для получения дополнительной информации.\nЕсли у вас есть вопросы или вам нужна помощь, просто напишите мне, и я постараюсь помочь! 💬',
    'no_echo': 'Данный тип апдейтов не поддерживается '
               'методом send_copy',
    'confirmation': '✅ПОДТВЕРДИТЬ✅',
    'basket_buyer':'КОРЗИНА',
    'android':'💠Android💠',
    'iphone':'💠iPhone💠',
    'imac':'💠iMac💠',
    'dyson':'💠Dyson💠',
    'xbox':'💠PS5|XBox💠',
    'watch':'💠Apple Watch💠',
    'watch_garmin':'💠Garmin💠',
    'airpods':'💠AirPods💠',
    'ipad':'💠iPad💠',
    'macbook':'💠MacBook💠',
    'iphone_se':'💠iPhone SE💠',
    'iphone_11':'💠iPhone 11💠',
    'iphone_12':'💠iPhone 12💠',
    'iphone_12_PROMAX':'💠iPhone 12 Pro Max💠',
    'iphone_12_MINI':'💠iPhone 12 Mini💠',
    'iphone_13':'💠iPhone 13💠',
    'iphone_14':'💠iPhone 14💠',
    'iphone_14_PROMAX':'💠iPhone 14 Pro Max💠',
    'iphone_14_PRO':'💠iPhone 14 Pro💠',
    'iphone_14_PLUS':'💠iPhone 14 Plus💠',
    'iphone_15':'💠iPhone 15💠',
    'iphone_15_PROMAX':'💠iPhone 15 Pro Max💠',
    'iphone_15_PLUS':'💠iPhone 15 Plus💠',
    'iphone_16':'💠iPhone 16💠',
    'iphone_16_PLUS':'💠iPhone 16 Plus💠',
    'accesuares':'💠Аксессуары💠',
    'charger':'💠Зарядные устройства💠',
    'back':'↩️НАЗАД↩️',
    'cancellation':'❌ОТМЕНА❌',
    'text_menu': '🍏Розничная и оптовая продажа, ремонт техники Apple🍏\n\nПриобрести технику или записаться на ремон / Trade-in'
}

LEXICON_COMMANDS_RU: dict[str, str] = {
    'personal_account':'👤Личный кабинет👤',
    'catalog':'🛍Каталог🛍',
    'orders':'📦Заказы📦',
    'delivery':'📦Виды доставки📦',
    'pay': '💸Виды оплаты💸',
    'news':'📍Новости📍',
    'support': '⚙️Поддержка',
    'confirmation': '✅ПОДТВЕРДИТЬ✅',
    'basket_buyer':'🛒КОРЗИНА🛒',
    'search':'🔎Поиск устройства🔎'
    
}

LEXICON_PAGINATION_RU:dict[str, str] = {
    'forward': '⏩',
    'backward': '⏪'
}

LEXICON_DELYVERY_RU:dict[str, str] = {
    
    'standart_delivery':'Стандартная доставка - от 3 дней',
    'shop_delivery':'Заберу с магазина сам',
    'curyer_delivery':'Курьером',
    'standart_pay':'онлайн и система быстрых платежей (СБП)',
    'nal_pay':'картой или наличными при получении'
}